InformationRegisters/ИнтернетЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ИнтернетЗаявки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата и время получения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Comment>Регион внешнего абонента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Имя интернет-ресурса нашей компании, с которого получена заявка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнешний</Name>
					<Comment>Телефон внешнего абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СигнатураПочтовогоСообщения</Name>
					<Comment>Сигнатура почтового сообщения (Message ID), если интернет-заявка создана по почтовому сообщению</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>170</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИнтернетЗаявкиСвойства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ИнтернетЗаявкиСвойства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Comment>Дата и время получения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокИнтернетЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокИнтернетЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелНомерныеПланы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ТелНомерныеПланы</Name>
			<Comment>Телефонные номерные планы стран мира</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонДиапазона</Name>
					<Comment>Конечный номер диапазона</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Страна</Name>
					<Comment>Страна или регион</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачДиапазона</Name>
					<Comment>Начальный номер диапазона</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

WebServices/CallFromSite/Ext/Module.bsl
Функция DataGet(PhoneNum, Site, Extra = "")
	//Выполняет автозвонок
	
	ЗначениеПоУмолчанию = "";
	
	Доступно = ЗначениеЗаполнено(PhoneNum);
	
	Если Не Доступно Тогда
		Возврат "error 01";
	КонецЕсли;
	
	Если PhoneNum = "9506080025" Тогда
		Возврат "<div><div><p>test</p></div></div>";
	КонецЕсли;
	
	//Сформируй ИД интернет-заявки
	//----------------------------------
	Ид = Новый УникальныйИдентификатор();
	Сигнатура = xmlСтрока(Ид);
	
	ТекДата = ТекущаяДата();
	
	//Добавь интернет-заявку
	//--------------------------------------------------------------------------------------------
	Выполнено = РегистрыСведений.ИнтернетЗаявки.Добавить(Сигнатура, ТекДата, Site, PhoneNum, Extra);
	Если Не Выполнено Тогда
		Возврат "error 011"
	КонецЕсли;
	
	// Заполни свойства интернет-заявки
	//---------------------------------------------------------------------------------
	Результат = "";
	Если Лев(Extra, 1)="{" Тогда
		Результат = РегистрыСведений.ИнтернетЗаявкиСвойства.Добавить(Сигнатура, Extra);
	КонецЕсли; 
	
	//По интернет-заявкам со свойством "form type" = "Заказать выездную презентацию" не создаем задач,
	//отправляем письмо менеджеру
	Если Результат = "Выполнено. Заказать выездную презентацию" Тогда
		Если ЗадачиСервер.ЭтоИнтенетЗаявкаФормы_ЗаказатьВыезднуюПрезентацию(Сигнатура) Тогда
			Возврат "error 012";
		КонецЕсли;	
	КонецЕсли;
	
	//Сконвертируй номер телефона
	//---------------------------------------------------------
	Телефон = Конвертация.ТелефонВнешнийНормализовать(PhoneNum);
	
	//Если после конвертации в номере остались не цифры - задачу не создаем
	//---------------------------------------------------------------------
	Если Не Конвертация.ЭтоТолькоЦифры(Телефон) Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	//Добавить префикс выхода на международную линию, если телефонный номер зарубежный
	//--------------------------------------------------------------------------------
	Если СтрДлина(Телефон)>=10 Тогда
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТелНомерныеПланы.Страна КАК Страна
		|ИЗ
		|	РегистрСведений.ТелНомерныеПланы КАК ТелНомерныеПланы
		|ГДЕ
		|	ТелНомерныеПланы.НачДиапазона >= &Телефон
		|	И ТелНомерныеПланы.КонДиапазона <= &Телефон
		|	И ТелНомерныеПланы.Страна.Наименование <> &Наименование";
		Запрос.УстановитьПараметр("Телефон", Число(Телефон));
		Запрос.УстановитьПараметр("Наименование", "Российская Федерация");
		РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
		Если Не РезультатЗапроса.Пустой() Тогда
			Телефон = "810"+Телефон;
		КонецЕсли;
	КонецЕсли;
	
	ЗакройЗадачу = Ложь;
	
	//Если свойство form_type = "Регистрация" или  form_type = "Диалог в чает" нужно и создать задачу и сразу ее закрыть
	//----------------------------------------------------------------------------------------------------------------
	Если Результат = "Выполнено. Регистрация" Тогда
		ЗакройЗадачу = Истина;
	КонецЕсли;
	
	ЗадачиСервер.СоздайЗадачуКакЗаявкуИлиКакАвтозвонок(Телефон, Site, Сигнатура, ЗакройЗадачу);
	
	Возврат "accepted"
КонецФункции

Функция LeadGenic(prop)
	// Вставить содержимое обработчика.
КонецФункции
